tap "facebook/fb"
tap "homebrew/cask-versions"
# Collection of portable C++ source libraries
brew "boost"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Development kit for the Java programming language
brew "openjdk@17"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Convert images to PDF via direct JPEG inclusion
brew "img2pdf"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Swiss Army Knife for macOS
brew "m-cli"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Time tracking tool for agencies and freelancers
cask "clockify"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Desktop debugging platform for mobile developers
cask "flipper"
# Screen colour temperature controller
cask "flux-app"
# GIT client
cask "fork"
# Hosts file editor/manager
cask "gas-mask"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal built on web technologies
cask "hyper"
# Utility to reduce the size of 24-bit PNG files
cask "imagealpha"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Music discovery app
cask "ios-console"
# Keep your computer awake
cask "jiggler"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Open-source keystroke visualiser
cask "keycastr"
# Visual user interface for Docker Container management
cask "kitematic"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Unpacks archive files
cask "the-unarchiver"
# Git client focusing on power and productivity
cask "tower"
# PKG software package uninstall tool
cask "uninstallpkg"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
# OpenJDK distribution from Azul
cask "zulu@11"
# OpenJDK distribution from Azul
cask "zulu@17"
vscode "be5invis.vscode-custom-css"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "infeng.vscode-react-typescript"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "nathanchapman.javascriptsnippets"
vscode "naumovs.color-highlight"
vscode "naumovs.theme-oceanicnext"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "tobiasalthoff.atom-material-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
